{
  "8470:1800": {
    "0": {
      "title": "Card",
      "index": 0,
      "datatype": "header",
      "element": {
        "id": "8470:1800"
      },
      "content": {
        "firstResource": "Invision",
        "firstResourceLink": "https://xdc.invisionapp.com/dsm/xdc/ads-coral/nav/618b927d570ae67e07227cea/asset/62bc5a590a8fda653ca8834e/tab/usage%20guidelines?version=64e4797d08c5154790f01222&mode=preview",
        "secondResource": "Storybook",
        "secondResourceLink": "https://storybook.js.org/"
      },
      "publish": true,
      "inProgress": true,
      "docId": "8903:4768"
    },
    "1": {
      "title": "Info",
      "index": 1,
      "datatype": "text",
      "text": "A card is a visually appealing element used to present short or compact pieces of information. It is visualized as a container which groups various pieces of content that acts as entry point to detailed information. It displays content and actions on a single topic.\nA card can display different element such as images, text, link, charts, buttons, etc.",
      "publish": true
    },
    "2": {
      "title": "Do's and Don'ts",
      "index": 2,
      "datatype": "two-columns",
      "content": {
        "subtitle1": "Do",
        "subtitle2": "Don't",
        "text1": "Browsing experience - Provide a summary of similar items. Examples: commerce sites (products cards), price plans, kanban board, Pinterest.\nSummary page - Provide summaries of many/different kinds of content on the same page, such as dashboards, news feeds, blogs, etc.\nEmphasize few results - When you want to emphasize a few results over the rest. For example, show the first 3 results as cards and all the rest in a list or table.\nMobile view - on mobile, card view might be used instead of a tabular view.",
        "text2": "Search experience (as search results) - when users are goal oriented to finding a specific item, card is less appropriate than a list.\nAs section divider - Don't force content into cards when spacing, headlines, or dividers would create a simpler visual hierarchy.\nComparing items - if users need to compare items, a list of table views are more appropriate.\nIn all the above cases, a card layout will be less appropriate because it is less scannable than a list and it takes a lot of space (less scrolling means less demand on users' short-term memory).\nFor search, consider using vertical cards (like a list, see below). For example: events list, contacts list, playlists etc."
      },
      "publish": true
    },
    "3": {
      "title": "How to use",
      "index": 3,
      "datatype": "list",
      "publish": true,
      "content": {
        "inputs": [
          "Keep it simple – cards should contain only required element to create focused view, don’t undercut this focus by adding complexity into you card.",
          "Keep it consistent – use similar structure for all cards in the same group / of the same kind.",
          "Set the priority - make sure that the content in the card has visual hierarchy. Prioritize the most important information.",
          "Call for action – don’t add many call to action to your card, keep them at the end of the card. If you have many actions use action menu. If you have only one action, make the whole card clickable.",
          "Give space - use grid which has same spacing between the cards, for easier scanning.",
          "Don’t mix - card cannot be inside another card or divided into multiple cards.",
          "Don’t scroll - A card should not have a vertical scroll, truncate the text, expand the card with a click or adjust the card size.",
          "One unified unit - card can be stand-alone unit, it can be display without relying on another element in the page. It is not possible to swipe portions of the card, swipe should work on the whole card, and it should have only one swipe action assigned to it."
        ],
        "listType": "unordered"
      }
    },
    "4": {
      "title": "One unified unit - card can be stand-alone unit, it can be display without relying on another element in the page. It is not possible to swipe portions of the card, swipe should work on the whole card, and it should have only one swipe action assigned to it.",
      "index": 4,
      "datatype": "image",
      "publish": true,
      "content": {
        "localFilePath": "",
        "remoteImageLink": "https://xdc.invisionapp.com/assets/A_MGFjZjlkZDY2YjhlM2JmOS_lD2ON55Xorcb5qEJ66gV1dIMpe7Ojry4YAnohQVN0wk6Sq9aIwDJsRYmQzeKfQl8GlbrfXmPgtzMZru-Lb2g=?assetKey=xdc%2Fads-coral%2Fimage-B190yz533.png"
      }
    },
    "5": {
      "title": "Horizontal",
      "index": 5,
      "datatype": "image",
      "publish": true,
      "content": {
        "localFilePath": "",
        "remoteImageLink": "https://xdc.invisionapp.com/assets/A_MGFjZjlkZDY2YjhlM2JmOdr7AcN35piIxkzDfGrx2Kry5Z7eIFLFFahp_2em7vrSM5i2ZnemhGU9F-NGa1CL79CuQNkB0eJ-IuVcduv0Hbg=?assetKey=xdc%2Fads-coral%2Fimage-SkDWef9n2.png"
      }
    },
    "6": {
      "title": "Related components and patterns",
      "index": 6,
      "datatype": "link",
      "publish": true,
      "content": {
        "sources": [
          {
            "source": "Card button",
            "link": "https://www.figma.com/proto/9KXDuflEXQTfqirV9D7lYu/Amdocs-Documentation?page-id=368%3A2359&type=design&node-id=472-24925&viewport=1286%2C725%2C0.28&t=2u6Ut0hXlV2wX8Md-1&scaling=min-zoom&mode=design"
          }
        ]
      }
    },
    "7": {
      "title": "Reference",
      "index": 7,
      "datatype": "link",
      "publish": true,
      "content": {
        "sources": [
          {
            "source": "NNg",
            "link": "https://www.nngroup.com/articles/cards-component/"
          },
          {
            "source": "Material Design",
            "link": "https://m3.material.io/components/cards/guidelines"
          },
          {
            "source": "Carbon Design System (IBM)",
            "link": "https://carbondesignsystem.com/components/tile/usage/"
          }
        ]
      }
    },
    "8": {
      "title": "Basic",
      "index": 8,
      "datatype": "video",
      "publish": true,
      "content": {
        "selectedVideo": 0,
        "selectedVideoContent": {
          "element": "Card",
          "name": "Basic card element",
          "video": "https://www.youtube.com/embed/HJN_Q01ZnM4?si=g5kAoHcObtLhT6Tj",
          "thumbnail": "https://img.youtube.com/vi/HJN_Q01ZnM4/sddefault.jpg"
        }
      }
    },
    "9": {
      "title": "Complex",
      "index": 9,
      "datatype": "video",
      "publish": true,
      "content": {
        "selectedVideo": 1,
        "selectedVideoContent": {
          "element": "Card",
          "name": "Complex card element",
          "video": "https://www.youtube.com/embed/Vna2a4g8WyQ?si=NLfnKX-7f4T9DQxy",
          "thumbnail": "https://img.youtube.com/vi/Vna2a4g8WyQ/sddefault.jpg"
        }
      }
    }
  },
  "8470:1817": {
    "0": {
      "title": "Button",
      "index": 0,
      "datatype": "header",
      "element": {
        "id": "8470:1817"
      },
      "content": {
        "firstResource": "Figma Dev",
        "firstResourceLink": "https://www.figma.com/developers",
        "secondResource": "GitHub",
        "secondResourceLink": "https://github.com/"
      },
      "publish": true,
      "inProgress": true,
      "docId": "8902:4737"
    },
    "1": {
      "title": "Property",
      "index": 1,
      "datatype": "element",
      "publish": false
    },
    "2": {
      "title": "Variants",
      "index": 2,
      "datatype": "element",
      "publish": false
    },
    "3": {
      "title": "Overview",
      "index": 3,
      "datatype": "text",
      "text": "Buttons are clickable elements that are used to trigger actions. They communicate calls to action to the user and allow users to interact with pages in a variety of ways. Button labels express what action will occur when the user interacts with it.\n",
      "publish": true
    },
    "4": {
      "title": "Fluid versus default buttons",
      "index": 4,
      "datatype": "text",
      "text": "Button alignment is also closely related to whether the button is treated as a default or a fluid element within a layout. When we say “fluid”, we mean that the button becomes a part of a larger, compound component by bleeding to two or more edges of its container. Rather than defining the a fluid button’s width in columns or mini units, its width is defined as a percentage (often 50%) of the container’s width. Also, as a general rule, fluid primary buttons are never left-aligned in a layout or a container—they’re always either right-aligned, or span the full width of the container.\n",
      "publish": true
    },
    "5": {
      "title": "Do's and Don'ts",
      "index": 5,
      "datatype": "two-columns",
      "content": {
        "subtitle1": "Do",
        "subtitle2": "Don't",
        "text1": "Use buttons to communicate actions users can take and to allow users to interact with the page. Each page should have only one primary button, and any remaining calls to action should be represented as lower emphasis buttons.\n",
        "text2": "Do not use buttons as navigational elements. Instead, use links when the desired action is to take the user to a new page.\n"
      },
      "publish": true
    },
    "6": {
      "title": "Related",
      "index": 6,
      "datatype": "link",
      "publish": true,
      "content": {
        "sources": [
          {
            "source": "Link component",
            "link": "https://carbondesignsystem.com/components/link/usage"
          },
          {
            "source": "Modal component",
            "link": "https://carbondesignsystem.com/components/modal/usage"
          },
          {
            "source": "Form pattern",
            "link": "https://carbondesignsystem.com/patterns/forms-pattern"
          }
        ]
      }
    },
    "7": {
      "title": "Alignment",
      "index": 7,
      "datatype": "image",
      "publish": true,
      "content": {
        "localFilePath": "",
        "remoteImageLink": "https://carbondesignsystem.com/static/8fd3c3bf86e338ae28b153b5825cfe8d/92c65/button_usage_10.png"
      }
    },
    "8": {
      "title": "Release Notes",
      "index": 8,
      "datatype": "element",
      "publish": false
    }
  },
  "8802:7229": {
    "0": {
      "title": "Hebrew test",
      "index": 0,
      "datatype": "header",
      "element": {
        "id": "8802:7229"
      },
      "content": {
        "firstResource": "wiki",
        "firstResourceLink": "https://he.wikipedia.org/wiki/%D7%A2%D7%91%D7%A8%D7%99%D7%AA",
        "secondResource": "",
        "secondResourceLink": ""
      },
      "publish": true,
      "inProgress": true,
      "docId": "8900:4710"
    },
    "1": {
      "title": "היסטוריה של השפה העברית",
      "index": 1,
      "datatype": "text",
      "text": "העברית היא שפה המשתייכת לקבוצת הלשונות השמיות הצפון-מערביות, ומהווה את הניב בו דיברו תושבי ארץ ישראל החל מן האלף ה-2 לפנה\"ס[דרוש מקור] בלב האזור המכונה במקרא בשם ארץ כנען. כנען או הלבנט כולל היום את שטחיהן של לבנון, סוריה, ארץ ישראל וירדן. השפה הפיניקית אשר הייתה מדוברת באזור לבנון של ימינו היא \"שפה אחות\" לשפה העברית.\n\nבעברית נכתבו רוב ספרי התנ\"ך, כל המשנה, רוב הספרים החיצוניים ורוב המגילות הגנוזות. המקרא נכתב בעברית מקראית, ואילו המשנה נכתבה בניב הקרוי לשון חז\"ל. בתקופה מסוימת בסוף המאה ה-2 לספירה או קצת מאוחר יותר (החוקרים חלוקים בשאלה זו) פסקו רוב היהודים מלהשתמש בעברית כבשפת דיבור. מאות שנים בלבד לאחר חתימת המשנה, כאשר חדלו היהודים להשתמש בעברית, כבר נכתבו התלמודים בארמית. עם זאת, ישנן עדויות שאף במאה ה-8 לספירה הייתה שפת הדיבור בטבריה, שם פעלו בעלי המסורה, עברית.\n\n\nפרק ל' בספר יחזקאל, מכתב-יד בודליאנה Or. 62. הטקסט הופק על ידי מלומדים נוצרים באנגליה בסביבות 1210, ולעברית נלווים תרגום ופרשנות בלטינית.\nגם כשהשפה העברית לא שימשה שפת דיבור, עדיין שימשה לאורך הדורות, במה שמכונה תקופת הביניים של העברית, כשפת הכתב העיקרית של היהודים, בעיקר בעניינים הלכתיים: כתיבת פרוטוקולים של בתי דין, קובצי הלכות, פרשנות לכתבי קודש ועוד. גם כתיבת מכתבים וחוזים בין גברים יהודים נעשתה לעיתים קרובות בעברית. ספרות דתית לנשים בקהילות אשכנזיות נכתבה ביידיש (למשל \"צאינה וראינה\"), בקהילות הספרדיות בלאדינו, ובארצות ערב, בערבית יהודית המקומית, כיוון שהנשים, בניגוד לגברים, לא למדו עברית. חיבורים יהודיים בעלי אופי חילוני או לא-הלכתי נכתבו בשפות יהודיות או בשפות זרות, לדוגמה: הרמב\"ם כתב את ספרו \"משנה תורה\" בעברית, על אף שספרו הפילוסופי המפורסם \"מורה נבוכים\", שיועד למשכילי זמנו, נכתב בערבית יהודית.[דרוש מקור: מנין ההשערה שמו\"נ נכתב בערבית כיוון שאפיו לא הלכתי? גם פיהמ\"ש וספהמ\"צ נכתבו בערבית.] עם זאת, \"מורה נבוכים\", כמו ספרים אחרים בנושאים חילוניים, תורגמו לעברית כשהיה בהם עניין לקהילות יהודיות דוברות שפות אחרות. אחת המשפחות היהודיות המפורסמות שעסקו בתרגום מערבית-יהודית לעברית בימי הביניים היא משפחת אִבְּן תִּיבּוֹן. מפעלי התרגום לעברית של ספרות מדעית ופילוסופית בימי הביניים נתקלו בקושי מהותי, שכן עדיין לא היו מינוחים עבריים מקבילים למושגים מקצועיים רבים. אבן תיבון ומתרגמים נוספים נאלצו לחדש שורה ארוכה של מילים בשפה, וחלק ניכר מן המונחים הללו שרד ומשמש את דוברי השפה העברית עד היום.",
      "publish": true
    }
  },
  "8895:4572": {
    "0": {
      "title": "Label",
      "index": 0,
      "datatype": "header",
      "element": {
        "id": "8895:4572"
      },
      "content": {
        "firstResource": "wiki",
        "firstResourceLink": "https://en.wiktionary.org/wiki/%E4%BA%AC%E5%B8%AB",
        "secondResource": "",
        "secondResourceLink": ""
      },
      "publish": true,
      "inProgress": true,
      "docId": "8898:4701"
    },
    "1": {
      "title": "Variants",
      "index": 1,
      "datatype": "element",
      "publish": false
    },
    "2": {
      "title": "Timeline of Kyoto.",
      "index": 2,
      "datatype": "text",
      "text": "In the Sengoku period, the city suffered extensive destruction in the Ōnin War of 1467–1477, and did not really recover until the mid-16th century.[9] During the war, battles between samurai factions spilled into the streets, and came to involve court nobility (kuge) and religious factions as well. Nobles' mansions were transformed into fortresses, deep trenches dug throughout the city for defense and as firebreaks, and numerous buildings burned. The city has not seen such widespread destruction since.\n\nIn the late 16th century, Toyotomi Hideyoshi reconstructed the city by building new streets to double the number of north–south streets in central Kyoto, creating rectangle blocks superseding ancient square blocks. Hideyoshi also built earthwork walls called odoi (御土居) encircling the city. Teramachi Street in central Kyoto is a Buddhist temple quarter where Hideyoshi gathered temples in the city.",
      "publish": true
    },
    "3": {
      "title": "Kyoto Prefecture",
      "index": 3,
      "datatype": "link",
      "publish": true,
      "content": {
        "sources": [
          {
            "source": "Kyoto Prefecture",
            "link": "https://en.wikipedia.org/wiki/Kyoto_Prefecture"
          }
        ]
      }
    }
  }
}