{"8470:1800":{"0":{"title":"Card","index":0,"datatype":"header","element":{"id":"8470:1800"},"content":{"firstResource":"Invision","firstResourceLink":"https://xdc.invisionapp.com/dsm/xdc/ads-coral/nav/618b927d570ae67e07227cea/asset/62bc5a590a8fda653ca8834e/tab/usage%20guidelines?version=64e4797d08c5154790f01222&mode=preview","secondResource":"","secondResourceLink":""},"publish":true,"inProgress":true},"1":{"title":"Info","index":1,"datatype":"text","content":"A card is a visually appealing element used to present short or compact pieces of information. It is visualized as a container which groups various pieces of content that acts as entry point to detailed information. It displays content and actions on a single topic.\nA card can display different element such as images, text, link, charts, buttons, etc.","publish":true},"2":{"title":"Do's and Don'ts","index":2,"datatype":"two-columns","content":{"subtitle1":"Do","subtitle2":"Don't","text1":"Browsing experience - Provide a summary of similar items. Examples: commerce sites (products cards), price plans, kanban board, Pinterest.\nSummary page - Provide summaries of many/different kinds of content on the same page, such as dashboards, news feeds, blogs, etc.\nEmphasize few results - When you want to emphasize a few results over the rest. For example, show the first 3 results as cards and all the rest in a list or table.\nMobile view - on mobile, card view might be used instead of a tabular view.","text2":"Search experience (as search results) - when users are goal oriented to finding a specific item, card is less appropriate than a list.\nAs section divider - Don't force content into cards when spacing, headlines, or dividers would create a simpler visual hierarchy.\nComparing items - if users need to compare items, a list of table views are more appropriate.\nIn all the above cases, a card layout will be less appropriate because it is less scannable than a list and it takes a lot of space (less scrolling means less demand on users' short-term memory).\nFor search, consider using vertical cards (like a list, see below). For example: events list, contacts list, playlists etc."},"publish":true},"3":{"title":"How to use","index":3,"datatype":"list","publish":true,"content":{"inputs":["Keep it simple – cards should contain only required element to create focused view, don’t undercut this focus by adding complexity into you card.","Keep it consistent – use similar structure for all cards in the same group / of the same kind."],"listType":"unordered"}},"4":{"title":"Reference","index":4,"datatype":"link","publish":true,"content":{"inputs":[{"source":"NNG","link":"https://www.nngroup.com/articles/cards-component/"}]}},"5":{"title":"Basic","index":5,"datatype":"video","publish":true,"content":{"selectedVideo":0,"selectedVideoContent":{"element":"Card","name":"Basic card element","video":"https://www.youtube.com/embed/HJN_Q01ZnM4?si=g5kAoHcObtLhT6Tj","thumbnail":"https://img.youtube.com/vi/HJN_Q01ZnM4/sddefault.jpg"}}}},"8470:1817":{"0":{"title":"Button","index":0,"datatype":"header","element":{"id":"8470:1817"},"content":{"firstResource":"Figma Dev","firstResourceLink":"https://www.figma.com/developers","secondResource":"","secondResourceLink":""},"publish":true,"inProgress":true},"1":{"title":"Overview","index":1,"datatype":"text","content":"Buttons are clickable elements that are used to trigger actions. They communicate calls to action to the user and allow users to interact with pages in a variety of ways. Button labels express what action will occur when the user interacts with it.","publish":true},"2":{"title":"Do's and Don'ts","index":2,"datatype":"two-columns","content":{"subtitle1":"Do","subtitle2":"Don't","text1":"Use buttons to communicate actions users can take and to allow users to interact with the page. Each page should have only one primary button, and any remaining calls to action should be represented as lower emphasis buttons.\n","text2":"Do not use buttons as navigational elements. Instead, use links when the desired action is to take the user to a new page.\n"},"publish":true},"3":{"title":"Alignment","index":3,"datatype":"image","publish":true,"content":{"localFilePath":"","remoteImageLink":"https://carbondesignsystem.com/static/8fd3c3bf86e338ae28b153b5825cfe8d/92c65/button_usage_10.png"}}},"8802:7229":{"0":{"title":"Input","index":0,"datatype":"header","element":{"id":"8802:7229"},"content":{"firstResource":"wiki","firstResourceLink":"https://en.wikipedia.org/wiki/90377_Sedna","secondResource":"","secondResourceLink":""},"publish":true,"inProgress":true},"1":{"title":"","index":1,"datatype":"text","content":"Sedna (minor-planet designation 90377 Sedna) is a dwarf planet in the outermost reaches of the Solar System discovered in 2003. Spectroscopy has revealed that Sedna's surface composition is largely a mixture of water, methane, and nitrogen ices with tholins, similar to those of some other trans-Neptunian objects. Its surface is one of the reddest among Solar System objects. Sedna, within estimated uncertainties, is tied with Ceres as the largest planetoid not known to have a moon. It has a diameter of approximately 1,000 km (most likely between the sizes of the dwarf planet Ceres and Saturn's moon Tethys), with an unknown mass.\n\nSedna's orbit is one of the largest in the Solar System, with its aphelion (farthest distance from the Sun) being approximately 937 astronomical units (AU).[6] This is 31 times Neptune's distance from the Sun, and well beyond the closest portion of the heliopause, which defines the outer boundary of interplanetary space. As of 2023, Sedna is near perihelion, its closest approach to the Sun, at a distance of 84 AU (13 billion km), almost three times farther than Neptune. The dwarf planets Eris and Gonggong are presently further from the Sun than Sedna. An exploratory fly-by mission to Sedna at perihelion could be completed in 24.5 years using a Jupiter gravity assist.[15]","publish":true}}}